"""
Напишите программу, которая определит позицию второго вхождения строки в списке либо сообщит, что её нет.

Пример:

список: ["qwe", "asd", "zxc", "qwe", "ertqwe"], ищем: "qwe", ответ: 3
список: ["йцу", "фыв", "ячс", "цук", "йцукен", "йцу"], ищем: "йцу", ответ: 5
список: ["йцу", "фыв", "ячс", "цук", "йцукен"], ищем: "йцу", ответ: -1
список: ["123", "234", 123, "567"], ищем: "123", ответ: -1
список: [], ищем: "123", ответ: -1
"""

def find_index(lst, s):
    counter = 0
    for i, x in enumerate(lst):
        if s == x:
            counter += 1
            if counter == 2:
                return i
    return -1


lst_01 = ["qwe", "asd", "zxc", "qwe", "ertqwe"]
lst_03 = ["йцу", "фыв", "ячс", "цук", "йцукен"]

s = input()

result = find_index(lst_03, s)
print(result)

